/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   checker_main.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jslave <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/03 15:40:44 by jslave            #+#    #+#             */
/*   Updated: 2020/02/03 15:40:46 by jslave           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../inc/checker.h"

//int 		check_order()

int 		main(int ac, char **av)
{/*
	if (ac <= 1)
	{
		printf("no arguments.\n");
		exit(1);
	}
	if (check_validity(ac, av) == 1)
	{
 		сесть написать все команды
		инициализировать массив или список листов после валидности
		валидность каждой команды иначе ошибка
		начать выполнять команды
		как завершать программу через кнтрл д?
		в конце в зависимости от результата получилось или нет вернуть ОК или КО
		начать писать сам пушсвап лол
		printf("OK\n");
	}
	else
		printf("error\n");*/
	(void)ac;
	(void)av;
	char buf[100];
	char *msg="you wrote:";
	while (1) {
		int n;
		n=read (0, buf, sizeof(buf));
		write (1, msg, strlen(msg));
		write (1, buf, n);
	}
	return (0);
}
